Autodesk.Revit.DB.AnnotationLabelParameterFormatting.GetParameterDefinition(Autodesk.Revit.DB.Document)
The definition of the parameter shown in the label.
document:
The document which contains the label and parameter.
Returns:
The definition of the parameter shown in the label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.LeadingLineBreak
True if a leading line break should be added the leading spaces, prefix and parameter value.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.Suffix
The suffix to add after the parameter value.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.SampleText
The sample text to show in the label in the family environment.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.ParameterId
The id of the parameter shown in the label.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.Prefix
The prefix to add before the parameter value.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.LeadingSpaces
The number of spaces to add before the parameter value.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.IsLeadingParam
True if this parameter is the first parameter in the label.
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.InternalDefinition)
Constructions a new annotation label parameter formatting object for a parameter.
document:
A valid Revit document.
paramDef:
The parameter for this annotation label parameter formatting object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationLabelParameterFormatting
The annotation label parameter formatting settings for a parameter in an annotation label element.
Since:
2027